fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/ВКМ_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_Сотрудники</name>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>EnumRef.ВКМ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ВКМ_Суммовой</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Catalogs/ВКМ_Сотрудники/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СоздатьМенеджерЗаписи();
	Запись.Сотрудник   = Ссылка;
	Запись.Период      = ДействуетС;
	Запись.Оклад       = ?(ЗначениеЗаполнено(Оклад), Оклад, 0);
	Запись.ПроцентОтРабот = ?(ЗначениеЗаполнено(ПроцентОтРабот), ПроцентОтРабот, 0);
	
	Попытка
		Запись.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации(
		"Ошибка записи условий оплаты сотрудника",
		УровеньЖурналаРегистрации.Ошибка,
		,
		Ссылка,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
